my_depot/app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 21
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 25
---
<% unless cart.line_items.empty? %>