my_depot/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "15"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 26 Nov 2011 06:30:19 UTC +00:00], ["updated_at", Sat, 26 Nov 2011 06:30:19 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 29], ["created_at", Wed, 30 Nov 2011 05:50:43 UTC +00:00], ["order_id", nil], ["product_id", 15], ["quantity", 1], ["updated_at", Wed, 30 Nov 2011 05:50:43 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2011-11-28 21:52:52.374695' WHERE "line_items"."id" = 12
---
   def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save