my_depot/app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc', per_page:10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0